<<<<<<< HEAD
{"_default": {"1": {"id": 1, "name": "How Plants Make Their Food: Photosynthesis ", "content": "How Plants Make Their Food: Photosynthesis \nIntroduction​\n Photosynthesis is the amazing process that plants use to make their own food. Just like we \nneed food to have energy, plants use sunlight to create energy for themselves. This process \ntakes place in the leaves of plants and is the reason why our world is full of green plants! \nWhat is Photosynthesis?​\n Photosynthesis means “putting together with light.” Plants take in sunlight, water, and a gas \ncalled carbon dioxide from the air. With the help of a special green pigment called chlorophyll, \nplants mix these ingredients together to make sugar (a type of food) and oxygen. The sugar \ngives the plant the energy to grow, and the oxygen is released into the air for us to breathe. \nHow It Works \n1.​ Sunlight: The sun’s light gives energy to the plant.​\n \n2.​ Water: Roots absorb water from the soil and send it up to the leaves.​\n \n3.​ Carbon Dioxide: Leaves take in carbon dioxide from the air.​\n \n4.​ Chlorophyll: The green pigment in leaves that uses sunlight to start the process.​\n \n5.​ Food and Oxygen: With all these ingredients, plants produce sugar (food) and oxygen \n(which they release into the air).​\n \nThe Magic of Chlorophyll​\n Chlorophyll is what makes plants green! It is very important for photosynthesis because it helps \ncapture the sunlight. Think of chlorophyll as a solar panel that turns light into energy. Without \nchlorophyll, plants wouldn’t be able to make food and would not survive. \nWhy Is Photosynthesis Important? \n●​ For Plants: It provides the energy plants need to grow, produce fruits, and create seeds.​\n \n●​ For Animals and People: The oxygen released by plants is essential for all living \nthings.​\n \n●​ For the Environment: Photosynthesis helps keep our planet healthy by reducing carbon \ndioxide levels in the air.​\n \n \n\nFun Facts \n●​ Every green leaf on the planet is a tiny food factory!​\n \n●​ Some plants, like cacti, are experts at photosynthesis even in very hot and dry places.​\n \n●​ Without photosynthesis, there would be no plants—and without plants, animals (and us!) \nwouldn’t have enough oxygen to breathe.​\n \nConclusion​\n Photosynthesis is a natural miracle that keeps life on Earth going. It turns sunlight, water, and \nair into food for plants and oxygen for all living creatures. Next time you see a green leaf, \nremember it’s working hard to make food and help the world breathe! \n \n", "summary": "Photosynthesis is how plants make their own food, like a plant's personal kitchen! Plants use sunlight, water, and a gas called carbon dioxide to create sugar (their food) and oxygen.\n\nHere's how it works: roots grab water, leaves grab carbon dioxide, and chlorophyll (the green stuff in leaves) uses sunlight to mix everything together. This creates the plant's food (sugar) and releases oxygen into the air, which we breathe.\n\nPhotosynthesis is super important because it gives plants energy to grow, gives us oxygen, and helps keep the Earth healthy by cleaning the air. Every green leaf is like a tiny food factory powered by the sun!", "quizzes": [], "attempts": []}, "2": {"id": 2, "name": "Gravity ", "content": "Gravity \nWhat is Gravity?​\n Gravity is a natural force that pulls objects toward each other. It is the reason you stay \non the ground, why apples fall from trees, and why everything from small pebbles to \nhuge planets has weight. Every object—even you—has gravity, but the strength of the \ngravitational pull depends on the object’s mass (how much matter it contains). The Earth \nis very massive, so its gravity is strong, which is why we never float away. \nGravity is also the reason we experience weight. When you stand on a scale, it measures \nthe force of Earth's gravity acting on your body. Without gravity, there would be no \nweight, and everything would just float around in space. \nFun Facts About Gravity: \n●​ Gravity is present everywhere—even in space. Although its strength decreases \nwith distance, it still affects the motion of planets and stars.​\n \n●​ The Moon’s gravity is much weaker than Earth’s, so astronauts on the Moon can \njump higher and float more easily.​\n \n●​ Gravity holds our solar system together, keeping the Earth in orbit around the Sun \nand the Moon orbiting around Earth.​\n \n●​ Even though gravity seems like a simple force, scientists study it deeply because \nit shapes the entire universe.​\n \n●​ According to Einstein’s theory of relativity, gravity even affects time. In strong \ngravitational fields, time can pass more slowly compared to places with weaker \ngravity. \nHow Does Gravity Work?​\nGravity works by attracting objects toward each other. The more mass an object has, the \nstronger its gravitational pull. For example, the Earth’s large mass creates a strong \ngravitational force that keeps everything—people, water, animals, and even the \natmosphere—stuck to the planet. \nWhen you drop something, gravity pulls it down to the ground. This same force also \nkeeps the Moon orbiting around Earth, and it holds the planets in orbit around the Sun. \nWithout gravity, our solar system would not exist, and there would be no structure to the \nuniverse. \nA Brief History:​\n Scientists have been curious about gravity for centuries. Sir Isaac Newton famously \n\nexplained gravity when he saw an apple fall from a tree, proposing that a force pulls \nobjects toward one another. Later, Albert Einstein expanded on this idea with his theory \nof general relativity, which describes gravity as the curvature of space and time caused \nby mass. \nMore on Gravity: \n●​ Gravity is an invisible force—although you cannot see it, you can see its effects \nevery day, like why water flows downhill or why objects fall when dropped.​\n \n●​ Even though gravity is one of the weakest forces in nature, its effects are \nsignificant because it acts over long distances and on objects with a lot of mass.​\n \n●​ Gravity is essential not only for keeping us grounded but also for the formation of \ngalaxies, stars, and planets. \n \n \n", "summary": "Gravity is a force that pulls objects together; the bigger something is, the stronger its pull. It's why we stay on the ground, and it keeps planets orbiting the Sun. Scientists like Newton and Einstein helped us understand gravity, and it's super important for how the universe works.", "quizzes": [], "attempts": []}, "3": {"id": 3, "name": "GUARDIAN BOT: A TURTLEBOT", "content": "GUARDIAN BOT: A TURTLEBOT\nCARE PROJECT\nProduct Specification Document\nTeam: Howard Dynamics\nSaharsha Tiwari, Prasun Dhungana, Sameer Acharya, Manish Adhikari,\nManish Niure\n\nTable of Contents\n1.\nPurpose\n2.\nOverview\n3.\nRequirements\n4.\nTraceability Matrix\n5.\nDesign\n6.\nTechnologies\n7.\nFront End\n8.\nBack End\n9.\nAdditional Features\n10. Database Design\n11. User Interface (Mock-ups)\n12. Test Strategy and Test Plan\n13. References\n\n1. Purpose\nThere’s a huge percentage of the population in the United States that faces some sort of\nhealth-related risk. About 27% of elderly people are living alone, while over 61 million\npeople are living with some sort of disability. However, less than 1% of this population\ncurrently benefits from having a service dog or such a companion. Acquiring a service\ndog isn’t easy either, costing from around $15,000 to $30,000 or more upfront, and at\nleast $500 to $10,000 a year for food and veterinary care. A 2001 study also concludes\nthat in this group, a significantly high mortality risk arises from late response to medical\nemergencies. Moreover, about 1.3 million elderly who reside in nursing and care\nfacilities face a significant risk of accidents within or outside the facility.\n2. Overview\nOur project utilizes Amazon Robotics Turtlebots to create a solution to these problems,\nusing a combination of robotics, machine learning and natural language processing, and\nsoftware engineering to help the elderly and disabled population as well as eldercare\nworkers in the United States. The Guardian Bot, our project product, will have features\nand functionalities akin to a service animal, on top of being capable of emergency\nresponse, navigation, and ensuring the overall wellness of its target users. We hope that\nthe Guardian Bot project helps mitigate the shortcomings in emergency response and\neldercare, as well as be the service animal equivalent to this at-risk population in the\nUnited States.\n3. Requirements\n1. Safe navigation through indoor and outdoor spaces should be enabled.\n2. Falls should be detected, and emergency services should be contacted.\n3. A compartment with first aid supplies should be provided, with guidance on their\nusage.\n4. Voice commands should be responded to for presence confirmation and to\nreduce user anxiety.\n\n5. Medication reminders should be given, and caregivers notified if a dose is\nmissed.\n6. Eldercare facilities should be navigated autonomously, and staff alerted in case\nof accidents.\n7. Presence in a room should be confirmed, offering comfort to individuals with\nmental health needs.\n8. User location within the facility should be tracked, and real-time updates provided\nto caregivers.\n4. Traceability Matrix\nFull link to RTM:\nhttps://docs.google.com/spreadsheets/d/1Po-oHaSF0-DEChLDxLjBXbdu1M7s9ne8jw69TzcCZ\nHo/edit?usp=sharing\nAssignee\nREQUIREMENTS FEATURES/FUNCTIONS\nF1\nF2\nF3\nF4\nF5\nF6\nSaharsha Tiwari\nR1. Safe navigation through indoor and\noutdoor spaces should be enabled.\nX\nManish Niure\nR2. Falls should be detected, and\nemergency services should be contacted.\nX\nX\nSameer Acharya\nR3. A compartment with first aid supplies\nshould be provided, with guidance on\ntheir usage.\nX\nX\nPrasun Dhungana\nR4. Voice commands should be\nresponded to for presence confirmation,\nreducing user anxiety.\nX\nManish Adhikari\nR5. Medication reminders should be\ngiven, and caregivers should be notified if\na dose is missed.\nX\nX\nSaharsha Tiwari\nR6. Eldercare facilities should be\nX\nX\nX\nX\n\nnavigated autonomously, and staff should\nbe alerted in case of accidents.\nSameer Acharya\nR7. Presence in a room should be\nconfirmed, offering comfort to individuals\nwith mental health needs.\nX\nPrasun Dhungana\nR8. User location within the facility\nshould be tracked, and real-time updates\nprovided to caregivers.\nX\nX\n5. Design\nThe flowchart describes how the Guardian Bot interacts with the user and caregivers.\nSolid arrows indicate direct interactions: the user gives voice commands to the\nGuardian Bot, which in turn sends real-time updates and emergency alerts to caregivers,\nensuring user safety and effective communication. It navigates environments, manages\nmedication reminders, and provides first aid if needed. Additionally, it confirms user\npresence to reduce anxiety. The dashed arrows represent extra functionalities:\nEnvironmental Monitoring and Companion Mode. Environmental Monitoring checks\nroom conditions and alerts caregivers if conditions become unsafe, while Companion\nMode engages the user with calming conversations and jokes, providing mental health\n\nsupport. Each arrow thus represents a flow of information or action, connecting the\ndifferent components of the system to ensure comprehensive care.\n6. Technologies\n1. Amazon Robotics TurtleBot 4 is the main hardware platform for navigation,\nequipped with sensors for obstacle detection and mapping.\n2. ROS 2 (Robot Operating System) is a middleware framework we will use to\nhandle robot control, safe navigation, and integration of sensors and actuators.\n3. TensorFlow and OpenCV will be used for machine learning tasks such as fall\ndetection, voice recognition, image processing, and so on.\n4. AWS IoT Core and MQTT will be used for communication between the robot and\ncaregiver systems, enabling real-time alerts and monitoring.\n5. Twilio API is an efficient way we will utilize to send emergency notifications and\nalerts via SMS or voice calls to caregivers.\n6. Dialogflow or Rasa will be used for natural language processing and voice\ninteraction capabilities.\n7. Front End\n1. React.js will be used for developing a caregiver dashboard and interface to track\nuser activity and receive notifications.\n2. Figma will be used to design and prototype user-friendly interfaces for both\nmobile and web applications.\n3. Flutter will be used to build a mobile application for caregivers with\ncross-platform compatibility.\n\n8. Back End\n1. Firebase will be used for user authentication and real-time database functionality,\nstoring caregiver and user data.\n2. AWS Lambda will be used for serverless execution of backend logic such as\nprocessing emergency alerts or scheduling medication reminders.\n3. PostgreSQL database will be used to store user data, location history, and\ncaregiver information in a robust and scalable way.\n9. Additional Features\nIf the project is completed and time permits, we can add a few additional features to the\nGuardian Bot. One of the major features we are eyeing is Environmental Monitoring,\nwhich will monitor room conditions such as temperature, humidity, etc., and alert\ncaregivers if the environment becomes unsafe for the user. Similarly, features such as\nsmoke and carbon monoxide detection would also be provided to the user(s).\nIn addition, one other stretch goal is to have a Companion Mode for mental health\nsupport, where the Guardian Bot’s interface can engage the user with calming\nconversations, jokes, or personalized messages to reduce anxiety and loneliness, and\neven play soothing music or audiobooks upon user request for comfort or mental\nstimulation.\n\n10. Database Design\n\n11. User Interface (Mockups)\n12. Test Strategy and Test Plan\nOur testing strategy ensures that the Guardian Bot functions reliably and meets all\ndefined requirements. We will implement the following testing methodologies:\nUnit Testing: Automated tests will validate individual software components, such as fall\ndetection algorithms and voice recognition modules.\nIntegration Testing: We will verify that different modules, such as navigation and\nemergency alert systems, work seamlessly together.\n\nEnd-to-End Testing: Full system testing will ensure the bot performs as intended in\nreal-world scenarios, including navigation, emergency response, and caregiver\ncommunication.\nManual Testing: Team members will manually test hardware interactions, user\ninterfaces, and edge cases to validate overall functionality.\nWe will ensure that each feature mapped in the Traceability Matrix will be tested, and\nresults will be recorded thoroughly. Test results will be documented, reviewed by the\nteam, and iteratively improved upon during the Agile development process.\n13. References\n1. https://pmc.ncbi.nlm.nih.gov/articles/PMC1955366/\n2. https://www.theacademyofpetcareers.com/blog/service-dog-training-cost/#:~:te\nxt=Average%20Service%20Dog%20Training%20Costs,-The%20cost%20of&text=G\nuide%20Dogs%3A%20%2420%2C000%20to%20%2450%2C000,Support%20Dogs\n%3A%20%2410%2C000%20to%20%2425%2C000\n3. https://www.nytimes.com/2023/11/02/realestate/more-american-seniors-live-al\none.html#:~:text=According%20to%20a%20study%20by,higher%20than%20the%\n20global%20average.\n4. https://www.aplaceformom.com/senior-living-data/articles/elderly-nursing-home\n-population\n", "summary": "The Guardian Bot is a robot designed to help elderly and disabled people by acting like a service animal. It can navigate, detect falls, remind people to take medicine, and even contact emergency services if needed. The robot uses cool technology like sensors, voice recognition, and machine learning to keep people safe and comfortable.", "quizzes": [], "attempts": []}, "4": {"id": 4, "name": "GUARDIAN BOT: A TURTLEBOT", "content": "GUARDIAN BOT: A TURTLEBOT\nCARE PROJECT\nProduct Specification Document\nTeam: Howard Dynamics\nSaharsha Tiwari, Prasun Dhungana, Sameer Acharya, Manish Adhikari,\nManish Niure\n\nTable of Contents\n1.\nPurpose\n2.\nOverview\n3.\nRequirements\n4.\nTraceability Matrix\n5.\nDesign\n6.\nTechnologies\n7.\nFront End\n8.\nBack End\n9.\nAdditional Features\n10. Database Design\n11. User Interface (Mock-ups)\n12. Test Strategy and Test Plan\n13. References\n\n1. Purpose\nThere’s a huge percentage of the population in the United States that faces some sort of\nhealth-related risk. About 27% of elderly people are living alone, while over 61 million\npeople are living with some sort of disability. However, less than 1% of this population\ncurrently benefits from having a service dog or such a companion. Acquiring a service\ndog isn’t easy either, costing from around $15,000 to $30,000 or more upfront, and at\nleast $500 to $10,000 a year for food and veterinary care. A 2001 study also concludes\nthat in this group, a significantly high mortality risk arises from late response to medical\nemergencies. Moreover, about 1.3 million elderly who reside in nursing and care\nfacilities face a significant risk of accidents within or outside the facility.\n2. Overview\nOur project utilizes Amazon Robotics Turtlebots to create a solution to these problems,\nusing a combination of robotics, machine learning and natural language processing, and\nsoftware engineering to help the elderly and disabled population as well as eldercare\nworkers in the United States. The Guardian Bot, our project product, will have features\nand functionalities akin to a service animal, on top of being capable of emergency\nresponse, navigation, and ensuring the overall wellness of its target users. We hope that\nthe Guardian Bot project helps mitigate the shortcomings in emergency response and\neldercare, as well as be the service animal equivalent to this at-risk population in the\nUnited States.\n3. Requirements\n1. Safe navigation through indoor and outdoor spaces should be enabled.\n2. Falls should be detected, and emergency services should be contacted.\n3. A compartment with first aid supplies should be provided, with guidance on their\nusage.\n4. Voice commands should be responded to for presence confirmation and to\nreduce user anxiety.\n\n5. Medication reminders should be given, and caregivers notified if a dose is\nmissed.\n6. Eldercare facilities should be navigated autonomously, and staff alerted in case\nof accidents.\n7. Presence in a room should be confirmed, offering comfort to individuals with\nmental health needs.\n8. User location within the facility should be tracked, and real-time updates provided\nto caregivers.\n4. Traceability Matrix\nFull link to RTM:\nhttps://docs.google.com/spreadsheets/d/1Po-oHaSF0-DEChLDxLjBXbdu1M7s9ne8jw69TzcCZ\nHo/edit?usp=sharing\nAssignee\nREQUIREMENTS FEATURES/FUNCTIONS\nF1\nF2\nF3\nF4\nF5\nF6\nSaharsha Tiwari\nR1. Safe navigation through indoor and\noutdoor spaces should be enabled.\nX\nManish Niure\nR2. Falls should be detected, and\nemergency services should be contacted.\nX\nX\nSameer Acharya\nR3. A compartment with first aid supplies\nshould be provided, with guidance on\ntheir usage.\nX\nX\nPrasun Dhungana\nR4. Voice commands should be\nresponded to for presence confirmation,\nreducing user anxiety.\nX\nManish Adhikari\nR5. Medication reminders should be\ngiven, and caregivers should be notified if\na dose is missed.\nX\nX\nSaharsha Tiwari\nR6. Eldercare facilities should be\nX\nX\nX\nX\n\nnavigated autonomously, and staff should\nbe alerted in case of accidents.\nSameer Acharya\nR7. Presence in a room should be\nconfirmed, offering comfort to individuals\nwith mental health needs.\nX\nPrasun Dhungana\nR8. User location within the facility\nshould be tracked, and real-time updates\nprovided to caregivers.\nX\nX\n5. Design\nThe flowchart describes how the Guardian Bot interacts with the user and caregivers.\nSolid arrows indicate direct interactions: the user gives voice commands to the\nGuardian Bot, which in turn sends real-time updates and emergency alerts to caregivers,\nensuring user safety and effective communication. It navigates environments, manages\nmedication reminders, and provides first aid if needed. Additionally, it confirms user\npresence to reduce anxiety. The dashed arrows represent extra functionalities:\nEnvironmental Monitoring and Companion Mode. Environmental Monitoring checks\nroom conditions and alerts caregivers if conditions become unsafe, while Companion\nMode engages the user with calming conversations and jokes, providing mental health\n\nsupport. Each arrow thus represents a flow of information or action, connecting the\ndifferent components of the system to ensure comprehensive care.\n6. Technologies\n1. Amazon Robotics TurtleBot 4 is the main hardware platform for navigation,\nequipped with sensors for obstacle detection and mapping.\n2. ROS 2 (Robot Operating System) is a middleware framework we will use to\nhandle robot control, safe navigation, and integration of sensors and actuators.\n3. TensorFlow and OpenCV will be used for machine learning tasks such as fall\ndetection, voice recognition, image processing, and so on.\n4. AWS IoT Core and MQTT will be used for communication between the robot and\ncaregiver systems, enabling real-time alerts and monitoring.\n5. Twilio API is an efficient way we will utilize to send emergency notifications and\nalerts via SMS or voice calls to caregivers.\n6. Dialogflow or Rasa will be used for natural language processing and voice\ninteraction capabilities.\n7. Front End\n1. React.js will be used for developing a caregiver dashboard and interface to track\nuser activity and receive notifications.\n2. Figma will be used to design and prototype user-friendly interfaces for both\nmobile and web applications.\n3. Flutter will be used to build a mobile application for caregivers with\ncross-platform compatibility.\n\n8. Back End\n1. Firebase will be used for user authentication and real-time database functionality,\nstoring caregiver and user data.\n2. AWS Lambda will be used for serverless execution of backend logic such as\nprocessing emergency alerts or scheduling medication reminders.\n3. PostgreSQL database will be used to store user data, location history, and\ncaregiver information in a robust and scalable way.\n9. Additional Features\nIf the project is completed and time permits, we can add a few additional features to the\nGuardian Bot. One of the major features we are eyeing is Environmental Monitoring,\nwhich will monitor room conditions such as temperature, humidity, etc., and alert\ncaregivers if the environment becomes unsafe for the user. Similarly, features such as\nsmoke and carbon monoxide detection would also be provided to the user(s).\nIn addition, one other stretch goal is to have a Companion Mode for mental health\nsupport, where the Guardian Bot’s interface can engage the user with calming\nconversations, jokes, or personalized messages to reduce anxiety and loneliness, and\neven play soothing music or audiobooks upon user request for comfort or mental\nstimulation.\n\n10. Database Design\n\n11. User Interface (Mockups)\n12. Test Strategy and Test Plan\nOur testing strategy ensures that the Guardian Bot functions reliably and meets all\ndefined requirements. We will implement the following testing methodologies:\nUnit Testing: Automated tests will validate individual software components, such as fall\ndetection algorithms and voice recognition modules.\nIntegration Testing: We will verify that different modules, such as navigation and\nemergency alert systems, work seamlessly together.\n\nEnd-to-End Testing: Full system testing will ensure the bot performs as intended in\nreal-world scenarios, including navigation, emergency response, and caregiver\ncommunication.\nManual Testing: Team members will manually test hardware interactions, user\ninterfaces, and edge cases to validate overall functionality.\nWe will ensure that each feature mapped in the Traceability Matrix will be tested, and\nresults will be recorded thoroughly. Test results will be documented, reviewed by the\nteam, and iteratively improved upon during the Agile development process.\n13. References\n1. https://pmc.ncbi.nlm.nih.gov/articles/PMC1955366/\n2. https://www.theacademyofpetcareers.com/blog/service-dog-training-cost/#:~:te\nxt=Average%20Service%20Dog%20Training%20Costs,-The%20cost%20of&text=G\nuide%20Dogs%3A%20%2420%2C000%20to%20%2450%2C000,Support%20Dogs\n%3A%20%2410%2C000%20to%20%2425%2C000\n3. https://www.nytimes.com/2023/11/02/realestate/more-american-seniors-live-al\none.html#:~:text=According%20to%20a%20study%20by,higher%20than%20the%\n20global%20average.\n4. https://www.aplaceformom.com/senior-living-data/articles/elderly-nursing-home\n-population\n", "summary": "", "quizzes": [], "attempts": []}}}
=======
{"_default": {"5": {"id": 2, "name": "Photosynthesis  ", "content": "Photosynthesis  \n \nIntroduction  \nPhotosynthesis is the amazing process that plants use to make their own food. Just like we \nneed food to have energy, plants use sunlight to create energy for themselves. This process \ntakes place in the leaves of plants and is the reason why our world is full of green plants!  \n \nWhat is Photosynthesis?  \nPhotosynthesis means “putting together with light.” Plants take in sunlight, water, and a gas \ncalled carbon dioxide from the air. With the help of a special green pigment called \nchlorophyll, plants mix these ingredients together to make sugar (a type of food) and \noxygen. The sugar gives the plant the energy to grow, and the oxygen is released into the \nair for us to breathe.  \n \nHow It Works  \n1. Sunlight: The sun’s light gives energy to the plant.  \n2. Water: Roots absorb water from the soil and send it up to the leaves.  \n3. Carbon Dioxide: Leaves take in carbon dioxide from the air.  \n4. Chlorophyll: The green pigment in leaves that uses sunlight to start the process.  \n5. Food and Oxygen: With all these ingredients, plants produce sugar (food) and oxygen \n(which they release into the air).  \n \nThe Magic of Chlorophyll  \nChlorophyll is what makes plants green! It is very important for photosynthesis because it \nhelps capture the sunlight. Think of chlorophyll as a solar panel that turns light into energy. \nWithout chlorophyll, plants wouldn’t be able to make food and would not survive.  \n \nWhy Is Photosynthesis Important?  \n● For Plants: It provides the energy plants need to grow, produce fruits, and create seeds.  \n● For Animals and People: The oxygen released by plants is essential for all living things.  \n● For the Environment: Photosynthesis helps keep our planet healthy by reducing carbon \ndioxide levels in the air.  \n \nFun Facts  \n● Every green leaf on the planet is a tiny food factory!  \n● Some plants, like cacti, are experts at photosynthesis even in very hot and dry places.  \n● Without photosynthesis, there would be no plants—and without plants, animals (and us!) \nwouldn’t have enough oxygen to breathe.  \n \nConclusion  \n\nPhotosynthesis is a natural miracle that keeps life on Earth going. It turns sunlight, water, \nand air into food for plants and oxygen for all living creatures. Next time you see a green \nleaf, remember it’s working hard to make food and help the world breathe!  \n \n \n", "summary": "Photosynthesis is how plants make their own food using sunlight, water, and carbon dioxide. They use a green stuff called chlorophyll to turn these ingredients into sugar for food and release oxygen into the air. This process is super important because it gives plants energy to grow and provides the oxygen we breathe!", "quizzes": ["Question: What three things do plants need for photosynthesis?\nA. Sunlight, soil, and oxygen\nB. Water, soil, and chlorophyll\nC. Sunlight, water, and carbon dioxide\nD. Carbon dioxide, chlorophyll, and soil\nCorrect Answer: C\n\nQuestion: What is the green pigment in plants that helps with photosynthesis called?\nA. Glucose\nB. Oxygen\nC. Carbon Dioxide\nD. Chlorophyll\nCorrect Answer: D\n\nQuestion: What are the two main products of photosynthesis?\nA. Water and carbon dioxide\nB. Sugar and carbon dioxide\nC. Sugar and oxygen\nD. Water and sunlight\nCorrect Answer: C", "Question: What three things do plants need for photosynthesis?\nA. Sunlight, sugar, and oxygen\nB. Water, oxygen, and chlorophyll\nC. Sunlight, water, and carbon dioxide\nD. Sugar, carbon dioxide, and chlorophyll\nCorrect Answer: C\n\nQuestion: What does chlorophyll do for plants?\nA. It helps plants absorb water from the soil.\nB. It gives plants their green color and captures sunlight.\nC. It helps plants release oxygen into the air.\nD. It helps plants absorb carbon dioxide from the air.\nCorrect Answer: B\n\nQuestion: Why is photosynthesis important for animals and people?\nA. It provides animals with food.\nB. It releases carbon dioxide for animals to breathe.\nC. It releases oxygen for animals to breathe.\nD. It helps animals find water.\nCorrect Answer: C", "Question: What three things do plants need for photosynthesis?\nA. Sunlight, oxygen, and sugar\nB. Sunlight, water, and carbon dioxide\nC. Water, oxygen, and chlorophyll\nD. Carbon dioxide, sugar, and chlorophyll\nCorrect Answer: B\n\nQuestion: What is the green pigment in plants that helps them capture sunlight?\nA. Glucose\nB. Carbon Dioxide\nC. Chlorophyll\nD. Oxygen\nCorrect Answer: C\n\nQuestion: What are the two main products of photosynthesis?\nA. Water and carbon dioxide\nB. Sugar and carbon dioxide\nC. Sunlight and water\nD. Sugar and oxygen\nCorrect Answer: D", "Question: What three things do plants need for photosynthesis?\nA. Sunlight, sugar, and oxygen\nB. Water, sugar, and chlorophyll\nC. Sunlight, water, and carbon dioxide\nD. Oxygen, chlorophyll, and carbon dioxide\nCorrect Answer: C\n\nQuestion: What is the green pigment that helps plants capture sunlight called?\nA. Carbon\nB. Chlorophyll\nC. Oxygen\nD. Sugar\nCorrect Answer: B\n\nQuestion: What important gas is released into the air during photosynthesis?\nA. Carbon Dioxide\nB. Nitrogen\nC. Hydrogen\nD. Oxygen\nCorrect Answer: D", "Question: What do plants need for photosynthesis?\nA. Sugar, Oxygen, and Sunlight\nB. Water, Carbon Dioxide, and Sunlight\nC. Chlorophyll, Sugar, and Water\nD. Oxygen, Chlorophyll, and Carbon Dioxide\nCorrect Answer: B\n\nQuestion: What is chlorophyll and what does it do?\nA. A type of plant food that helps them grow taller.\nB. A gas released by plants that animals breathe.\nC. The green pigment in plants that captures sunlight.\nD. A part of the plant that absorbs water from the soil.\nCorrect Answer: C\n\nQuestion: Why is photosynthesis important for animals and people?\nA. It provides us with sugar.\nB. It provides us with water.\nC. It provides us with carbon dioxide.\nD. It provides us with oxygen.\nCorrect Answer: D", "Question: What three things do plants need for photosynthesis?\nA. Sunlight, sugar, and oxygen\nB. Water, oxygen, and chlorophyll\nC. Sunlight, water, and carbon dioxide\nD. Carbon dioxide, sugar, and chlorophyll\nCorrect Answer: C\n\nQuestion: What does chlorophyll do for plants?\nA. Helps them absorb water\nB. Helps them capture sunlight\nC. Helps them release oxygen\nD. Helps them absorb carbon dioxide\nCorrect Answer: B\n\nQuestion: What is one reason why photosynthesis is important for animals and people?\nA. It provides us with sugar\nB. It provides us with food\nC. It releases carbon dioxide\nD. It releases oxygen\nCorrect Answer: D", "Question: What three things do plants need for photosynthesis?\nA. Sunlight, water, and oxygen\nB. Sunlight, water, and carbon dioxide\nC. Water, soil, and oxygen\nD. Sugar, chlorophyll, and carbon dioxide\nCorrect Answer: B\n\nQuestion: What does chlorophyll do for a plant?\nA. It helps the plant absorb water from the soil.\nB. It gives the plant the energy to grow tall.\nC. It captures sunlight to help make food.\nD. It releases oxygen into the air.\nCorrect Answer: C\n\nQuestion: Which of the following is NOT a reason why photosynthesis is important?\nA. It provides energy for plants to grow.\nB. It releases carbon dioxide for animals to breathe.\nC. It helps keep our planet healthy by reducing carbon dioxide.\nD. It provides oxygen for all living things.\nCorrect Answer: B"], "attempts": []}, "6": {"id": 3, "name": "Gravity ", "content": "Gravity \nWhat is Gravity?​\n Gravity is a natural force that pulls objects toward each other. It is the reason you stay \non the ground, why apples fall from trees, and why everything from small pebbles to \nhuge planets has weight. Every object—even you—has gravity, but the strength of the \ngravitational pull depends on the object’s mass (how much matter it contains). The Earth \nis very massive, so its gravity is strong, which is why we never float away. \nGravity is also the reason we experience weight. When you stand on a scale, it measures \nthe force of Earth's gravity acting on your body. Without gravity, there would be no \nweight, and everything would just float around in space. \nFun Facts About Gravity: \n●​ Gravity is present everywhere—even in space. Although its strength decreases \nwith distance, it still affects the motion of planets and stars.​\n \n●​ The Moon’s gravity is much weaker than Earth’s, so astronauts on the Moon can \njump higher and float more easily.​\n \n●​ Gravity holds our solar system together, keeping the Earth in orbit around the Sun \nand the Moon orbiting around Earth.​\n \n●​ Even though gravity seems like a simple force, scientists study it deeply because \nit shapes the entire universe.​\n \n●​ According to Einstein’s theory of relativity, gravity even affects time. In strong \ngravitational fields, time can pass more slowly compared to places with weaker \ngravity. \nHow Does Gravity Work?​\nGravity works by attracting objects toward each other. The more mass an object has, the \nstronger its gravitational pull. For example, the Earth’s large mass creates a strong \ngravitational force that keeps everything—people, water, animals, and even the \natmosphere—stuck to the planet. \nWhen you drop something, gravity pulls it down to the ground. This same force also \nkeeps the Moon orbiting around Earth, and it holds the planets in orbit around the Sun. \nWithout gravity, our solar system would not exist, and there would be no structure to the \nuniverse. \nA Brief History:​\n Scientists have been curious about gravity for centuries. Sir Isaac Newton famously \n\nexplained gravity when he saw an apple fall from a tree, proposing that a force pulls \nobjects toward one another. Later, Albert Einstein expanded on this idea with his theory \nof general relativity, which describes gravity as the curvature of space and time caused \nby mass. \nMore on Gravity: \n●​ Gravity is an invisible force—although you cannot see it, you can see its effects \nevery day, like why water flows downhill or why objects fall when dropped.​\n \n●​ Even though gravity is one of the weakest forces in nature, its effects are \nsignificant because it acts over long distances and on objects with a lot of mass.​\n \n●​ Gravity is essential not only for keeping us grounded but also for the formation of \ngalaxies, stars, and planets. \n \n \n", "summary": "Gravity is a force that pulls everything together, making things fall and giving them weight. The bigger something is, the stronger its gravity, like how Earth's gravity keeps us on the ground. Scientists like Newton and Einstein helped us understand gravity, and it's super important for holding planets and stars in place.", "quizzes": [], "attempts": []}}}
>>>>>>> 1e44cfe (all updated)
